CF/InformationRegisters/РаспределениеПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/InformationRegisters/РаспределениеПродаж/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура записывает данные в регистр.
//
// Параметры:
//	ТаблицаРегистра	- Таблица значений, структура = структура регистра.
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеВРегистр(ТаблицаРегистра) Экспорт
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.РаспределениеПродаж.СоздатьНаборЗаписей();
		КоличествоСтрок = ТаблицаРегистра.Количество()-1;
		
		Для Инд = 0 По КоличествоСтрок Цикл
			
			СтрокаТаблицыРегистра = ТаблицаРегистра[КоличествоСтрок - Инд];
			
			Если СтрокаТаблицыРегистра.Очистить Тогда
				
				НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
				НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
				НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать(Истина);
				ТаблицаРегистра.Удалить(СтрокаТаблицыРегистра);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицыРегистра Из ТаблицаРегистра Цикл
			
			НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
			НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
			НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицыРегистра);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.РаспределениеПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
